#+PROPERTY: header-args:clojure :exports both
#+PROPERTY: header-args:clojure+ :results silent
#+PROPERTY: header-args:clojure+ :session aggregation
#+PROPERTY: header-args:clojure+ :padline yes
#+PROPERTY: header-args:clojure+ :mkdirp yes
#+PROPERTY: header-args:clojure+ :tangle ../src/akvo/lumen/specs/aggregation.clj
#+FILETAGS: :aggregation:
** code analysis
 #+BEGIN_SRC shell :exports results
 echo "LOC  path"
 wc -l `find ../src/akvo/lumen/lib/aggregation -type f`
 echo "...  ..."
 wc -l ../src/akvo/lumen/lib/aggregation.clj
 #+END_SRC      

 #+RESULTS:
 | LOC | path                                         |
 | 107 | ../src/akvo/lumen/lib/aggregation/filter.clj |
 |  24 | ../src/akvo/lumen/lib/aggregation/pie.clj    |
 | 160 | ../src/akvo/lumen/lib/aggregation/pivot.clj  |
 |  10 | ../src/akvo/lumen/lib/aggregation/utils.clj  |
 | 301 | total                                        |
 | ... | ...                                          |
 |  46 | ../src/akvo/lumen/lib/aggregation.clj        |

*So far, 4 namespaces filter, pie, pivot, utils and a main ns ~lib.aggregation~. Worth noting that utils namespace only contains 10LOC*

* testing specs                                                       :tests:

*s/multi-spec* dispathing specs based in data props, in this case using ~:visualisation-type~

  #+BEGIN_SRC clojure :tangle no :results pp value replace :exports both
  (in-ns 'akvo.lumen.specs.aggregation)

  [(s/valid? (s/multi-spec query-type ::lib.aggregation/visualisation-type)
	     {::db.s/tenant-connection (lumen.s/sample ::db.s/tenant-connection)
	      ::dataset.s/dataset (lumen.s/sample ::dataset.s/dataset)
	      ::lib.aggregation/visualisation-type "pie"
	      :query (lumen.s/sample ::l.aggregation.pie/query)})

   (s/valid? (s/multi-spec query-type ::lib.aggregation/visualisation-type)
	     {::db.s/tenant-connection (lumen.s/sample ::db.s/tenant-connection)
	      ::dataset.s/dataset (lumen.s/sample ::dataset.s/dataset)
	      ::lib.aggregation/visualisation-type "pivot"
	      :query (lumen.s/sample ::l.aggregation.pivot/query)})

   (s/valid? (s/multi-spec query-type ::lib.aggregation/visualisation-type)
	     {:akvo.lumen.specs.db/tenant-connection
	      (lumen.s/sample ::db.s/tenant-connection),
	      ::dataset.s/dataset
	      {:table-name "ds_b1b3d3bc_771b_4ff7_af80_dc9b6b59921f",
	       :title "pivot",
	       :created 1528449334810,
	       :modified 1528449334810,
	       :id "5b1a4936-7ffd-4f59-9483-f2735d39fb0e",
	       :updated 1528449334825,
	       :columns
	       ({"sort" nil,
		 "type" "text",
		 "title" "A",
		 "hidden" false,
		 "direction" nil,
		 "columnName" "c1"}
		{"sort" nil,
		 "type" "text",
		 "title" "B",
		 "hidden" false,
		 "direction" nil,
		 "columnName" "c2"}
		{"sort" nil,
		 "type" "number",
		 "title" "C",
		 "hidden" false,
		 "direction" nil,
		 "columnName" "c3"}),
	       :transformations ()},
	      :akvo.lumen.lib.aggregation/visualisation-type "pivot",
	      :query {:aggregation "count"}}
	     )]
  #+END_SRC

  #+RESULTS:
  : [true true true]

* database: tenant aggregation tables                                   :sql:
 #+BEGIN_SRC sql :exports both :database lumen_tenant_1 :engine postgresql  :dbhost localhost :dbport 5432  :dbuser lumen :dbpassword password :exports results 
\d  dataset_version
 #+END_SRC

#+RESULTS:
 | Table "public.dataset_version" |                          |           |          |             |
 |--------------------------------+--------------------------+-----------+----------+-------------|
 | Column                         | Type                     | Collation | Nullable | Default     |
 | id                             | text                     |           | not null |             |
 | dataset_id                     | text                     |           | not null |             |
 | job_execution_id               | text                     |           | not null |             |
 | transformations                | jsonb                    |           | not null | '[]'::jsonb |
 | version                        | smallint                 |           | not null |             |
 | table_name                     | text                     |           |          |             |
 | imported_table_name            | text                     |           | not null |             |
 | columns                        | jsonb                    |           | not null | '[]'::jsonb |
 | created                        | timestamp with time zone |           | not null | now()       |
 | modified                       | timestamp with time zone |           | not null | now()       |

#+BEGIN_SRC sql :exports both :database lumen_tenant_1 :engine postgresql  :dbhost localhost :dbport 5432  :dbuser lumen :dbpassword password :exports code
\d  dataset
 #+END_SRC

 #+RESULTS:
 | Table "public.dataset" |                          |           |          |          |
 |------------------------+--------------------------+-----------+----------+----------|
 | Column                 | Type                     | Collation | Nullable | Default  |
 | id                     | text                     |           | not null |          |
 | title                  | text                     |           | not null |          |
 | description            | text                     |           | not null | ''::text |
 | created                | timestamp with time zone |           | not null | now()    |
 | modified               | timestamp with time zone |           | not null | now()    |
 
